# BuiltInFailures.AlignmentFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AlignmentFailures Class
BuiltInFailures Class Members See Also
---
Failures related to alignment elements and annotations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class AlignmentFailures
```

Visual Basic
---
```text
Public NotInheritable Class AlignmentFailures
```

Visual C++
---
```text
public ref class AlignmentFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..AlignmentFailures
# See Also
BuiltInFailures..::..AlignmentFailures Members
Autodesk.Revit.DB Namespace